goal_app/app/controllers/goals_controller.rb

  def create
    @goal = Goal.new(goal_params)
    @goal.user_id = current_user.id

    @goal.save
---
INSERT INTO "goals" ("user_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["body", "I have a huge goal"], ["created_at", "2018-09-14 23:38:32.498700"], ["updated_at", "2018-09-14 23:38:32.498700"]]

  def destroy
    @goal = Goal.find(params[:id])
    @goal.destroy
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 1]]